Run1234567/stm32_JLNU_Run/STM32F103-寄存器/Library_RUN/RUN_PWM.h
#ifndef _RUN_PWM_H_
#define _RUN_PWM_H_

#include "stm32f10x.h"

// ==============================================================================
// PWM 通道枚举 (覆盖 STM32F103ZET6 所有可用资源)
// 命名格式：PWM_定时器_通道_引脚
// ==============================================================================
typedef enum {
    // -----------------------------------------------------------------------
    // TIM1 (高级定时器, APB2 72MHz)
    // -----------------------------------------------------------------------
    // 默认引脚
    PWM_TIM1_CH1_PA8,  PWM_TIM1_CH2_PA9,  PWM_TIM1_CH3_PA10, PWM_TIM1_CH4_PA11,
    // 完全重映射 (Full Remap)
    PWM_TIM1_CH1_PE9,  PWM_TIM1_CH2_PE11, PWM_TIM1_CH3_PE13, PWM_TIM1_CH4_PE14,

    // -----------------------------------------------------------------------
    // TIM2 (通用定时器, APB1 36MHz*2)
    // -----------------------------------------------------------------------
    // 默认引脚 (注意: 与 TIM5_CH1-4 冲突，二选一)
    PWM_TIM2_CH1_PA0,  PWM_TIM2_CH2_PA1,  PWM_TIM2_CH3_PA2,  PWM_TIM2_CH4_PA3,
    // 完全重映射 (注意: PA15/PB3/PB4 是调试口，使用需关闭 JTAG)
    PWM_TIM2_CH1_PA15, PWM_TIM2_CH2_PB3,  PWM_TIM2_CH3_PB10, PWM_TIM2_CH4_PB11,

    // -----------------------------------------------------------------------
    // TIM3 (通用定时器, APB1 36MHz*2)
    // -----------------------------------------------------------------------
    // 默认引脚
    PWM_TIM3_CH1_PA6,  PWM_TIM3_CH2_PA7,  PWM_TIM3_CH3_PB0,  PWM_TIM3_CH4_PB1,
    // 完全重映射 (注意: 与 TIM8_CH1-4 冲突，二选一)
    PWM_TIM3_CH1_PC6,  PWM_TIM3_CH2_PC7,  PWM_TIM3_CH3_PC8,  PWM_TIM3_CH4_PC9,

    // -----------------------------------------------------------------------
    // TIM4 (通用定时器, APB1 36MHz*2)
    // -----------------------------------------------------------------------
    // 默认引脚
    PWM_TIM4_CH1_PB6,  PWM_TIM4_CH2_PB7,  PWM_TIM4_CH3_PB8,  PWM_TIM4_CH4_PB9,
    // 完全重映射
    PWM_TIM4_CH1_PD12, PWM_TIM4_CH2_PD13, PWM_TIM4_CH3_PD14, PWM_TIM4_CH4_PD15,

    // -----------------------------------------------------------------------
    // TIM5 (通用定时器, APB1 36MHz*2) - ZET6 独有
    // -----------------------------------------------------------------------
    // 默认引脚 (注意: 与 TIM2_CH1-4 冲突，二选一)
    PWM_TIM5_CH1_PA0,  PWM_TIM5_CH2_PA1,  PWM_TIM5_CH3_PA2,  PWM_TIM5_CH4_PA3,

    // -----------------------------------------------------------------------
    // TIM8 (高级定时器, APB2 72MHz) - ZET6 独有
    // -----------------------------------------------------------------------
    // 默认引脚 (注意: 与 TIM3重映射 冲突，二选一)
    PWM_TIM8_CH1_PC6,  PWM_TIM8_CH2_PC7,  PWM_TIM8_CH3_PC8,  PWM_TIM8_CH4_PC9,

    PWM_MAX
} RUN_PWM_enum;

// ==============================================================================
// 函数声明
// ==============================================================================

/**
 * @brief  PWM 初始化
 * @param  pwm_ch: 通道枚举 (如 PWM_TIM1_CH1_PA8)
 * @param  freq:   频率 (Hz), 如 50, 1000, 20000
 * @param  duty:   初始占空比 (0-10000), 5000=50%
 */
void RUN_pwm_init(RUN_PWM_enum pwm_ch, uint32_t freq, uint32_t duty);

/**
 * @brief  单独修改占空比
 * @param  duty: 0-10000
 */
void RUN_pwm_set(RUN_PWM_enum pwm_ch, uint32_t duty);

/**
 * @brief  单独修改频率
 * @param  freq: Hz
 * @note   警告：会改变该定时器下所有通道的频率！
 */
void RUN_pwm_freq(RUN_PWM_enum pwm_ch, uint32_t freq);

#endif